# Pandas

## Series

In [2]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np
import matplotlib.pyplot as plt

np.random.seed(12345)
plt.rc('figure', figsize=(10, 6))
PREVIOUS_MAX_ROWS = pd.options.display.max_rows
pd.options.display.max_rows = 20
np.set_printoptions(precision=4, suppress=True)

In [ ]:
# obj = pd.Series(range(3), index=['a', 'b', 'c'])
obj = pd.Series([1, 2, -5, 3], index=['a', 'b', 'b', 'c'])
dic = pd.Series({'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000})

In [21]:
dic_to = pd.Series(dic, index=['a', 'Texas', 'c', 'Utah'])
print(f"'a' in obj : {'a' in obj}")
print(obj * 2)
print(dic_to.isnull())

'a' in obj : True
a     2
b     4
b   -10
c     6
dtype: int64
a         True
Texas    False
c         True
Utah     False
dtype: bool

In [23]:
objt = dic_to + dic
objt.name = 'population'
objt.index.name = 'state'
objt.index = [0, 1, 2, 3, 4, 5]
print(objt)

0         NaN
1         NaN
2    142000.0
3     10000.0
4         NaN
5         NaN
Name: population, dtype: float64

## DataFrame

In [51]:
data2 = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data
    , columns=['year', 'state', 'pop']
    , index=['one', 'two', 'three', 'four', 'five', 'six'])
frame['dept'] = np.arange(6.)
frame['series'] = pd.Series([-1.5, 3, 5], index=['three', 'four', 'six'])
frame['eastern'] = frame.state == 'Ohio'
del frame['year']

frame.index.name = 'index_name'; frame.columns.name = 'column_name'

frame.head()
frame.tail(2)
frame.loc[['three', 'five']]

column_name   state  pop  dept  series  eastern
index_name
three          Ohio  3.6   2.0    -1.5     True
five         Nevada  2.9   4.0     NaN    False

In [ ]:
print(f"array : {frame.values}")
print(f"index array : {frame.index}")
print(f"'state' in frame.columns:{'state' in frame.columns}")
frame.T

array : [['Ohio' 1.5 0.0 nan True]
 ['Ohio' 1.7 1.0 nan True]
 ['Ohio' 3.6 2.0 -1.5 True]
 ['Nevada' 2.4 3.0 3.0 False]
 ['Nevada' 2.9 4.0 nan False]
 ['Nevada' 3.2 5.0 5.0 False]]
index array : Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object', name='index_name')
'state' in frame.colums:True

index_name    one   two three    four    five     six
column_name
state        Ohio  Ohio  Ohio  Nevada  Nevada  Nevada
pop           1.5   1.7   3.6     2.4     2.9     3.2
dept          0.0   1.0   2.0     3.0     4.0     5.0
series        NaN   NaN  -1.5     3.0     NaN     5.0
eastern      True  True  True   False   False   False